import operator
from typing import Any

from aiogram import F
from aiogram.types import CallbackQuery
from aiogram_dialog import Dialog, Window, DialogManager
from aiogram_dialog.widgets.kbd import Select, Column, Start
from aiogram_dialog.widgets.text import Const, Case, Format

from app.bot.states.help import HelpStates
from app.bot.states.main import MainStates

order = Const("""
📝 Є 3 способи замовити пісню:

- Натиснути на кнопку Замовити пісню та увести назву, бот вибере найімовірніший варіант

- Використовувати інлайн режим пошуку (увести @kpiradio_bot або натиснути на відповідну кнопку).
    У цьому випадку ти можеш вибрати із 50 знайдених варіантів з можливістю спочатку послухати

- Завантажити або надіслати боту бажану пісню
Після цього необхідно вибрати день та час для замовлення.
""")

moderation = Const("""
✅ Вітаються нейтральні, спокійні пісні, які не відволікатимуть від навчального процесу.

⚠️ Будь ласка, не замовляй багато пісень одразу. Не замовляй більше 1 треку на етер, окрім вечірнього.

❌ Відхиляються:
    - биті треки
    - треки довжиною менше 1 хвилини
    - треки довжиною понад 6 хвилин, крім вечірнього етеру
    - лайви, ремікси поганої якості
    - двічі та більше замовлений трек на один етер
    - треки з матами, поганим змістом
    - треки з невідповідною назвою
    - не формат радіо (див. нижче)

Скільки людей, стільки та смаків. Але ми найчастіше відхиляємо:
    - російський реп
    - треки з елементами скріму, жорсткого металу
    - гачі, стогін, аніме опенінги
    - кавери (radio tapok)
    - таких виконавців, як Корж, Команда Білоруських та подібні

❗️ Рупора радіо – не колонки у клубі. Памʼятай про це.
Модератори мають право відхилити ваш трек без пояснення причин.
""")

playlist = Const("""
⏭ Плейлист радіо:

- Дізнатися, що грає зараз, грало до цього або буде грати, можна, якщо натиснути на кнопку "Що грає"

- Памʼятаєш дату та час, коли грала пісня, та хочеш її знайти? Можеш знайти її там же — "Що грало?"

- Хочеш дізнатися, що буде грати в майбутньому? "Що гратиме"!

- Замовлення одноразове. Якщо твоя пісня не встигла увійти в етер, перезамов наступного разу.
""")

support = Const("""
🖌 Зворотній звʼязок:

- Ти завжди можеш написати команді адмінів, що думаєш про них і про радіо

- Якщо хочеш стати частиною радіо, пиши про це і готуйся до анкет

- Вважаєш щось незручним? Є пропозиції щодо покращення? Не замислюючись, пиши нам.

- У нас є чат @rhub_kpi
""")


async def get_data(**kwargs):
    return {
        "help": [
            ("📝 Замовлення пісні", "1"),
            ("❗️ Модерація", "2"),
            ("⏭ Плейліст", "3"),
            ("🖌 Зворотній звʼязок", "4"),
        ]
    }


async def on_fruit_selected(callback: CallbackQuery, widget: Any,
                            manager: DialogManager, item_id: str):
    manager.dialog_data["help_id"] = item_id

help_menu = Dialog(
    Window(
        Case({
            "1": order,
            "2": moderation,
            "3": playlist,
            "4": support,
            ...: Const("Вибери тему, що тебе цікавить. (Радимо прочитати все)")
        }, selector=F["dialog_data"]["help_id"]),
        Column(
            Select(
                Format("{item[0]}"),
                id="s_help",
                item_id_getter=operator.itemgetter(1),
                items="help",
                on_click=on_fruit_selected,
            ),
            Start(
                text=Const("Назад"),
                id="__main__",
                state=MainStates.main
            ),
        ),
        state=HelpStates.select,
        getter=get_data
    )
)
